MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33EV64GM006/mcu.h
/* AD1CSSL */
#define _CSS0 AD1CSSLbits.CSS0
#define _CSS1 AD1CSSLbits.CSS1
#define _CSS2 AD1CSSLbits.CSS2
#define _CSS3 AD1CSSLbits.CSS3
#define _CSS4 AD1CSSLbits.CSS4
#define _CSS5 AD1CSSLbits.CSS5
#define _CSS6 AD1CSSLbits.CSS6
#define _CSS7 AD1CSSLbits.CSS7
#define _CSS8 AD1CSSLbits.CSS8
#define _CSS9 AD1CSSLbits.CSS9
#define _CSS10 AD1CSSLbits.CSS10
#define _CSS11 AD1CSSLbits.CSS11
#define _CSS12 AD1CSSLbits.CSS12
#define _CSS13 AD1CSSLbits.CSS13
#define _CSS14 AD1CSSLbits.CSS14
#define _CSS15 AD1CSSLbits.CSS15

/* AD1CON4 */
#define _DMABL AD1CON4bits.DMABL
#define _ADDMAEN AD1CON4bits.ADDMAEN
#define _DMABL0 AD1CON4bits.DMABL0
#define _DMABL1 AD1CON4bits.DMABL1
#define _DMABL2 AD1CON4bits.DMABL2

/* CTMUCON1 */
#define _CTTRIG CTMUCON1bits.CTTRIG
#define _IDISSEN CTMUCON1bits.IDISSEN
#define _EDGSEQEN CTMUCON1bits.EDGSEQEN
#define _EDGEN CTMUCON1bits.EDGEN
#define _TGEN CTMUCON1bits.TGEN
#define _CTMUSIDL CTMUCON1bits.CTMUSIDL
#define _CTMUEN CTMUCON1bits.CTMUEN

/* CTMUCON2 */
#define _EDG2SEL CTMUCON2bits.EDG2SEL
#define _EDG2POL CTMUCON2bits.EDG2POL
#define _EDG2MOD CTMUCON2bits.EDG2MOD
#define _EDG1STAT CTMUCON2bits.EDG1STAT
#define _EDG2STAT CTMUCON2bits.EDG2STAT
#define _EDG1SEL CTMUCON2bits.EDG1SEL
#define _EDG1POL CTMUCON2bits.EDG1POL
#define _EDG1MOD CTMUCON2bits.EDG1MOD
#define _EDG2SEL0 CTMUCON2bits.EDG2SEL0
#define _EDG2SEL1 CTMUCON2bits.EDG2SEL1
#define _EDG2SEL2 CTMUCON2bits.EDG2SEL2
#define _EDG2SEL3 CTMUCON2bits.EDG2SEL3
#define _EDG1SEL0 CTMUCON2bits.EDG1SEL0
#define _EDG1SEL1 CTMUCON2bits.EDG1SEL1
#define _EDG1SEL2 CTMUCON2bits.EDG1SEL2
#define _EDG1SEL3 CTMUCON2bits.EDG1SEL3

/* CTMUICON */
#define _IRNG CTMUICONbits.IRNG
#define _ITRIM CTMUICONbits.ITRIM
#define _IRNG0 CTMUICONbits.IRNG0
#define _IRNG1 CTMUICONbits.IRNG1
#define _ITRIM0 CTMUICONbits.ITRIM0
#define _ITRIM1 CTMUICONbits.ITRIM1
#define _ITRIM2 CTMUICONbits.ITRIM2
#define _ITRIM3 CTMUICONbits.ITRIM3
#define _ITRIM4 CTMUICONbits.ITRIM4
#define _ITRIM5 CTMUICONbits.ITRIM5

/* SENT1CON1 */
/* Bitname _NIBCNT cannot be defined because it is used by more than one SFR */
/* Bitname _PS cannot be defined because it is used by more than one SFR */
/* Bitname _SPCEN cannot be defined because it is used by more than one SFR */
/* Bitname _PPP cannot be defined because it is used by more than one SFR */
/* Bitname _CRCEN cannot be defined because it is used by more than one SFR */
/* Bitname _TXPOL cannot be defined because it is used by more than one SFR */
/* Bitname _TXM cannot be defined because it is used by more than one SFR */
/* Bitname _RCVEN cannot be defined because it is used by more than one SFR */
/* Bitname _SNTSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _SNTEN cannot be defined because it is used by more than one SFR */

/* SENT1STAT */
/* Bitname _SYNCTXEN cannot be defined because it is used by more than one SFR */
/* Bitname _RXIDLE cannot be defined because it is used by more than one SFR */
/* Bitname _FRMERR cannot be defined because it is used by more than one SFR */
/* Bitname _CRCERR cannot be defined because it is used by more than one SFR */
/* Bitname _NIB cannot be defined because it is used by more than one SFR */
/* Bitname _PAUSE cannot be defined because it is used by more than one SFR */
/* Bitname _SYNC cannot be defined because it is used by more than one SFR */
/* Bitname _NIB0 cannot be defined because it is used by more than one SFR */
/* Bitname _NIB1 cannot be defined because it is used by more than one SFR */
/* Bitname _NIB2 cannot be defined because it is used by more than one SFR */
/* Bitname _TXEN cannot be defined because it is used by more than one SFR */

/* SENT1DATL */
/* Bitname _CRC cannot be defined because it is used by more than one SFR */
/* Bitname _DATA6 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA5 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA4 cannot be defined because it is used by more than one SFR */
/* Bitname _CRC0 cannot be defined because it is used by more than one SFR */
/* Bitname _CRC1 cannot be defined because it is used by more than one SFR */
/* Bitname _CRC2 cannot be defined because it is used by more than one SFR */
/* Bitname _CRC3 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA60 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA61 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA62 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA63 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA50 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA51 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA52 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA53 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA40 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA41 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA42 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA43 cannot be defined because it is used by more than one SFR */

/* SENT1DATH */
/* Bitname _DATA3 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA2 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA1 cannot be defined because it is used by more than one SFR */
/* Bitname _STAT cannot be defined because it is used by more than one SFR */
/* Bitname _DATA30 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA31 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA32 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA33 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA20 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA21 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA22 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA23 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA10 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA11 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA12 cannot be defined because it is used by more than one SFR */
/* Bitname _DATA13 cannot be defined because it is used by more than one SFR */
/* Bitname _STAT0 cannot be defined because it is used by more than one SFR */
/* Bitname _STAT1 cannot be defined because it is used by more than one SFR */
/* Bitname _STAT2 cannot be defined because it is used by more than one SFR */
/* Bitname _STAT3 cannot be defined because it is used by more than one SFR */

/* SENT2CON1 */
/* Bitname _NIBCNT cannot be defined because it is used by more than one SFR */
/* Bitname _PS cannot be defined because it is used by more than one SFR */
/* Bitname _SPCEN cannot be defined because it is used by more than one SFR */
/* Bitname _PPP cannot be defined because it is used by more than one SFR */
/* Bitname _CRCEN cannot be defined because it is used by more than one SFR */
/* Bitname _TXPOL cannot be defined because it is used by more than one SFR */
/* Bitname _TXM cannot be defined because it is used by more than one SFR */
/* Bitname _RCVEN cannot be defined because it is used by more than one SFR */
/* Bitname _SNTSIDL cannot be defined because it is used by more than one SFR */
/* Bitname _SNTEN cannot be defined because it is used by more than one SFR */

